# Pandas

# pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. ... The name is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals.

In [1]:
!pip install pandas  # mac User

ERROR: Invalid requirement: '#'

In [2]:
import pandas as pd

In [3]:
pwd()

'C:\\Users\\Ghost\\Pandas'

In [4]:
pd.read_csv("Data.csv")

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [5]:
df=pd.read_csv("Data.csv")

In [6]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df["maths"]

0    80
1    75
2    28
3    88
4    23
5    95
Name: maths, dtype: int64

In [9]:
df[["name","maths"]]

    name  maths
0    tom     80
1   jhon     75
2    max     28
3    raj     88
4  shyam     23
5    ram     95

In [10]:
df.head()

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail

In [11]:
df.head(4) # Print first N Rows

   name  maths  phy result
0   tom     80   70   Pass
1  jhon     75   67   Pass
2   max     28   55   Fail
3   raj     88   70   Pass

In [12]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [13]:
df.tail()

    name  maths  phy result
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [14]:
df.tail(2) # Print Last N Rows

    name  maths  phy result
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [15]:
df2=pd.read_table("tdata.tsv") # loading TSV file

In [16]:
df2

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [17]:
df3=pd.read_csv("tdata.tsv")

In [18]:
df3

  name\tmaths\tphy\tresult
0        tom\t80\t70\tPass
1       jhon\t75\t67\tPass
2        max\t28\t55\tFail
3        raj\t88\t70\tPass
4      shyam\t23\t29\tFail
5        ram\t95\t89\tPass

In [19]:
df3=pd.read_csv("tdata.tsv",sep="\t")

In [20]:
df3

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [21]:
df4=pd.read_csv("Data.csv",header=None)

In [22]:
df4

       0      1    2       3
0   name  maths  phy  result
1    tom     80   70    Pass
2   jhon     75   67    Pass
3    max     28   55    Fail
4    raj     88   70    Pass
5  shyam     23   29    Fail
6    ram     95   89    Pass

In [23]:
df5=pd.read_csv("Data.csv",names=["a","b","c","d"])

In [24]:
df5

       a      b    c       d
0   name  maths  phy  result
1    tom     80   70    Pass
2   jhon     75   67    Pass
3    max     28   55    Fail
4    raj     88   70    Pass
5  shyam     23   29    Fail
6    ram     95   89    Pass

In [25]:
df6=pd.read_csv("Data.csv",names=["a","b","c","d","e"])

In [26]:
df6

       a      b    c       d   e
0   name  maths  phy  result NaN
1    tom     80   70    Pass NaN
2   jhon     75   67    Pass NaN
3    max     28   55    Fail NaN
4    raj     88   70    Pass NaN
5  shyam     23   29    Fail NaN
6    ram     95   89    Pass NaN

In [27]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [28]:
df7=pd.read_csv("Data.csv",index_col=["maths"])

In [29]:
df7

        name  phy result
maths
80       tom   70   Pass
75      jhon   67   Pass
28       max   55   Fail
88       raj   70   Pass
23     shyam   29   Fail
95       ram   89   Pass

In [30]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [31]:
df.result.unique()

array(['Pass', 'Fail'], dtype=object)

In [32]:
df["result"].unique()

array(['Pass', 'Fail'], dtype=object)

In [33]:
df["result"].nunique()

2

In [34]:
df.maths.max()

95

In [35]:
df.phy.max()

89

In [36]:
df.phy.min()

29

In [37]:
df.maths.mean()

64.83333333333333

In [38]:
df.phy.median()

68.5

In [39]:
df.result.mode()

0    Pass
dtype: object

In [40]:
df["maths"].std()

31.262864018938934

In [41]:
df.dtypes

name      object
maths      int64
phy        int64
result    object
dtype: object

In [42]:
df.shape

(6, 4)

In [43]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   maths   6 non-null      int64
 2   phy     6 non-null      int64
 3   result  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [45]:
ipl=pd.read_html("https://www.iplt20.com/stats/2020/most-runs")

In [46]:
ipl

[    POS           PLAYER  Mat  Inns  NO  Runs    HS    Avg   BF      SR  100  \
 0     1        KL  Rahul   14    14   2   670  132*  55.83  518  129.34    1
 1     2  Shikhar  Dhawan   17    17   3   618  106*  44.14  427  144.73    2
 2     3    David  Warner   16    16   2   548   85*  39.14  407  134.64    0
 3     4    Shreyas  Iyer   17    17   2   519   88*  34.60  421  123.27    0
 4     5    Ishan  Kishan   14    13   4   516    99  57.33  354  145.76    0
 ..  ...              ...  ...   ...  ..   ...   ...    ...  ...     ...  ...
 95   96  Sandeep  Sharma   13     5   3    12     9   6.00   15   80.00    0
 96   97  Shardul  Thakur    9     2   1    12    11  12.00   21   57.14    0
 97   98   Mohammad  Nabi    1     1   1    11   11*      -    8  137.50    0
 98   99     Rinku  Singh    1     1   0    11    11  11.00   11  100.00    0
 99  100     Shivam  Mavi    8     3   1    10     9   5.00   14   71.42    0

     50  4s  6s
 0    5  58  23
 1    4  67  12
 2    4  52  14
 3    3  40  16
 4    4  36  30
 ..  ..  ..  ..
 95   0   1   0
 96   0   0   0
 97   0   2   0
 98   0   1   0
 99   0   1   0

 [100 rows x 14 columns]]

In [47]:
type(ipl)

list

In [48]:
ipl[0]

,POS,PLAYER,Mat,Inns,NO,Runs,HS,Avg,BF,SR,100,50,4s,6s
0,1,KL Rahul,14,14,2,670,132*,55.83,518,129.34,1,5,58,23
1,2,Shikhar Dhawan,17,17,3,618,106*,44.14,427,144.73,2,4,67,12
2,3,David Warner,16,16,2,548,85*,39.14,407,134.64,0,4,52,14
3,4,Shreyas Iyer,17,17,2,519,88*,34.60,421,123.27,0,3,40,16
4,5,Ishan Kishan,14,13,4,516,99,57.33,354,145.76,0,4,36,30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Sandeep Sharma,13,5,3,12,9,6.00,15,80.00,0,0,1,0
96,97,Shardul Thakur,9,2,1,12,11,12.00,21,57.14,0,0,0,0
97,98,Mohammad Nabi,1,1,1,11,11*,-,8,137.50,0,0,2,0
98,99,Rinku Singh,1,1,0,11,11,11.00,11,100.00,0,0,1,0
99,100,Shivam Mavi,8,3,1,10,9,5.00,14,71.42,0,0,1,0

In [49]:
type(ipl[0])

pandas.core.frame.DataFrame

In [51]:
len(ipl)

1

In [52]:
ipl_data=ipl[0]

In [53]:
ipl_data

,POS,PLAYER,Mat,Inns,NO,Runs,HS,Avg,BF,SR,100,50,4s,6s
0,1,KL Rahul,14,14,2,670,132*,55.83,518,129.34,1,5,58,23
1,2,Shikhar Dhawan,17,17,3,618,106*,44.14,427,144.73,2,4,67,12
2,3,David Warner,16,16,2,548,85*,39.14,407,134.64,0,4,52,14
3,4,Shreyas Iyer,17,17,2,519,88*,34.60,421,123.27,0,3,40,16
4,5,Ishan Kishan,14,13,4,516,99,57.33,354,145.76,0,4,36,30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Sandeep Sharma,13,5,3,12,9,6.00,15,80.00,0,0,1,0
96,97,Shardul Thakur,9,2,1,12,11,12.00,21,57.14,0,0,0,0
97,98,Mohammad Nabi,1,1,1,11,11*,-,8,137.50,0,0,2,0
98,99,Rinku Singh,1,1,0,11,11,11.00,11,100.00,0,0,1,0
99,100,Shivam Mavi,8,3,1,10,9,5.00,14,71.42,0,0,1,0

In [54]:
ipl_data.to_csv("Ipl_most_runs.csv") #Saving file to local disk

In [55]:
pwd()

'C:\\Users\\Ghost\\Pandas'